01_Dummy_cases/02_A02_Rotor/03_RM_compressible/constant/ReadMe.txt
Simulation mit OF_matchingPeriodicityCoarse_3 läuft durch mit SRFSimpleFoam